# 3. ชนิดข้อมูลแบบ set
# ประกอบด้วยข้อมูลหลายข้อมูล
# ต้องเขียนใน {????}
# ข้อมูลแบบ set เราจะถือข้อมูลที่เหมือนกันเป็นข้อมูลเดียว
# สามารถเปลี่ยนค่าได้
# ไม่มี index number กำกับข้อมูล จึงทำให้เป็นข้อมูลแบบไม่เรียงลำดับ
# การเข้าถึงข้อมูลใน set จะใช้การวนลูป คือ เข้าถึงข้อมูลทีละตัว

listData1 = [10, 20, 30, 40, 10]
tupleData1 = (10, 20, 30, 40, 10)
setData1 = {10, 20, 30, 40, 10} # จะถือว่ามี 4 ข้อมูล

print(listData1)
print(tupleData1)
print(setData1)
print('-----------------------------')
for data in setData1 :
    print(data)